## Plan Result (sbox-05-mis)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.log_analytics_role_aks_sp




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.log_analytics_role_aks_sp will be created
  + resource "azurerm_role_assignment" "log_analytics_role_aks_sp" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Log Analytics Contributor"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":472,"Program":"tfcmt","SHA1":"","Target":"sbox-05-mis","Vars":{}} -->